---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.DocumentOpeningEventArgs
source: html/fffb90f2-b772-ecd4-d742-7b34ba1c1200.htm
---
# DocumentOpeningEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.